package makeus.cmc.malmo.integration_test;

public class ChatRoomIntegrationTest {

    // TODO : 채팅방이 없는 경우 채팅방 상태 조회에 성공한다
    // TODO : 채팅방이 있는 경우 채팅방 상태 조회에 성공한다
    // TODO : 탈퇴한 사용자의 경우 채팅방 상태 조회에 실패한다

    // TODO : 채팅방이 있는 경우 채팅 전송에 성공한다
    // TODO : 채팅방이 없는 경우 채팅 전송에 실패한다
    // TODO : 탈퇴한 사용자의 경우 채팅 전송에 실패한다

    // TODO : 채팅방이 시작 단계인 경우 채팅 전송에 성공한다
    // TODO : 채팅방이 마지막 단계인 경우 채팅 전송에 성공한다

    // TODO : 채팅방 업그레이드에 성공한다
    // TODO : 탈퇴한 사용자의 경우 채팅방 업그레이드에 실패한다
    // TODO : 채팅방이 없는 경우 채팅방 업그레이드에 실패한다

    // TODO : 현재 채팅방 메시지 조회에 성공한다
    // TODO : 탈퇴한 사용자의 경우 현재 채팅방 메시지 조회에 실패한다
    // TODO : 채팅방이 없는 경우 현재 채팅방 메시지 조회에 실패한다


    // TODO : 채팅방 종료에 성공한다
    // TODO : 채팅방이 없는 경우 채팅방 종료에 실패한다
    // TODO : 탈퇴한 사용자의 경우 채팅방 종료에 실패한다

    // TODO : 채팅방 리스트 조회에 성공한다
    // TODO : 탈퇴한 사용자의 경우 채팅방 리스트 조회에 실패한다
    // TODO : 채팅방이 없는 경우 채팅방 리스트 조회에 성공한다
    // TODO : 삭제한 채팅방이 있는 경우 채팅방 리스트 조회에 성공한다

    // TODO : 채팅방 한 건 삭제에 성공한다
    // TODO : 채팅방 여러 건 삭제에 실패한다
    // TODO : 접근 권한이 없으면 채팅방 삭제에 실패한다
    // TODO : 탈퇴한 사용자의 경우 채팅방 삭제에 실패한다

    // TODO : 채팅방의 메시지 리스트 조회에 성공한다
    // TODO : 채팅방이 없는 경우 채팅방의 메시지 리스트 조회에 실패한다
    // TODO : 채팅방 접근 권한이 없는 경우 채팅방의 메시지 리스트 조회에 실패한다
    // TODO : 탈퇴한 사용자의 경우 채팅방의 메시지 리스트 조회에 실패한다

    // TODO : 채팅방 요약 조회에 성공한다
    // TODO : 채팅방이 없는 경우 채팅방 요약 조회에 실패한다
    // TODO : 채팅방 접근 권한이 없는 경우 채팅방 요약 조회에 실패한다
    // TODO : 탈퇴한 사용자의 경우 채팅방 요약 조회에 실패한다

}
