package makeus.cmc.malmo.integration_test;

public class SignInIntegrationTest {

    // TODO : 등록된 사용자의 경우 카카오 소셜 로그인에 성공한다
    // TODO : 등록되지 않은 사용자의 경우 카카오 소셜 로그인에 성공한다
    // TODO : 카카오 소셜 로그인 탈퇴한 멤버의 경우 사용자 정보 복구

    // TODO : 등록된 사용자의 경우 애플 소셜 로그인에 성공한다
    // TODO : 등록되지 않은 사용자의 경우 애플 소셜 로그인에 성공한다
    // TODO : 애플 소셜 로그인 탈퇴한 멤버의 경우 사용자 정보 복구

    // TODO : 리프레시 토큰을 통한 액세스 토큰 재발급에 성공한다
    // TODO : 만료된 리프레시 토큰을 통한 액세스 토큰 재발급에 실패한다
    // TODO : 유효하지 않은 리프레시 토큰을 통한 액세스 토큰 재발급에 실패한다
    // TODO : 탈퇴한 사용자의 리프레시 토큰을 통한 액세스 토큰 재발급에 실패한다
}
